In [1]:
############################### Pandas Library ######################################
### The most useful library for Data Analysis
### Data scientists often work with data stored in table formats like .csv, .tsv, or .xlsx
### with Pandas you can acquire, clean,explore, transform, and analyze your data
### Pandas is build on top of NumPy
### Data from Pandas is considers as input for other data analysis packages such as Matplotlib, scikit-learn, and sciPy
#####################################################################################

In [1]:
import pandas as pd

In [3]:
# Panadas has 2 structures: series and dataframe
# series: one-dimentional fixed type

In [4]:
##### Series
series1 = pd.Series([2,3,4,5])
series1

0    2
1    3
2    4
3    5
dtype: int64

In [5]:
type(series1)

pandas.core.series.Series

In [6]:
series1.index # get indices

RangeIndex(start=0, stop=4, step=1)

In [7]:
series1.values # get all values

array([2, 3, 4, 5], dtype=int64)

In [8]:
series1[0:2] # retrieve an element by index

0    2
1    3
dtype: int64

In [9]:
# specify index values
series2 = pd.Series([1,2,3,4,5,6], index=['a', 'b', 'c','d', 'e', 'f'])
series2

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [10]:
# group assignment
#series2['a'] = 5
series2['a', 'c', 'f'] = 0
series2

a    0
b    2
c    0
d    4
e    5
f    0
dtype: int64

In [11]:
# filtering
series2[series2 > 0] * 2 # note : it does not affect the original series

b     4
d     8
e    10
dtype: int64

In [12]:
# create a series of a dictionary structure
series3 = pd.Series({'a':2, 'b':5.5, 'c':3, 'd':6.3})
series3

a    2.0
b    5.5
c    3.0
d    6.3
dtype: float64

In [13]:
### DataFrames
# two-dimentional (i.e. like a table) where each column has data of the same type.
# generally speaking, a dataframe consists of a set or rows and columns, where columns represent the features and rows are the observations
# could be created from a collection of series or using the dictionary structure as we did before, or using arrays

In [3]:
# using array style
import numpy as np
#df = pd.DataFrame(np.array([[1,2,3],[4,5,6]]))
df = pd.DataFrame(np.array([[1,2,3],[4,5,6]]), columns=['A','B','C'])
df

   A  B  C
0  1  2  3
1  4  5  6

In [15]:
# replacing
df2 = df.replace([4,5,6],['a','b','c'])
print(df2);
df2.columns

   A  B  C
0  1  2  3
1  a  b  c

Index(['A', 'B', 'C'], dtype='object')

In [16]:
# Here, we will use dictionary style
# note: if you did not specify an index values, it will be assigned a range starting from 0 to N-1
df = pd.DataFrame({ 
    'country': ['Kazakhstan', 'Russia', 'Belarus', 'Ukraine'],
    'population': [17.04, 143.5, 9.5, 45.5],
    'square': [2724902, 17125191, 207600, 603628]
}, index=['KZ', 'RU', 'BY', 'UA'])

In [17]:
df # note that index column has not a header

       country  population    square
KZ  Kazakhstan       17.04   2724902
RU      Russia      143.50  17125191
BY     Belarus        9.50    207600
UA     Ukraine       45.50    603628

In [18]:
df.index.name = 'Country Code'
df # now index column has header

                 country  population    square
Country Code
KZ            Kazakhstan       17.04   2724902
RU                Russia      143.50  17125191
BY               Belarus        9.50    207600
UA               Ukraine       45.50    603628

In [19]:
# use the column name to get the whole column 
df['country']

Country Code
KZ    Kazakhstan
RU        Russia
BY       Belarus
UA       Ukraine
Name: country, dtype: object

In [20]:
## Get a whole Row or a set of rows can be done using .loc or iloc
# .loc takes the index label 
df.loc['KZ']

country       Kazakhstan
population         17.04
square           2724902
Name: KZ, dtype: object

In [21]:
# .iloc takes the index number
df.iloc[0]

country       Kazakhstan
population         17.04
square           2724902
Name: KZ, dtype: object

In [22]:
# getting the population of KZ and UA : .loc[[index list],[column list]]
df.loc[['KZ','UA'], 'population']

Country Code
KZ    17.04
UA    45.50
Name: population, dtype: float64

In [23]:
# get all features for Russia and Belarus
df.loc[['RU', 'BY'], : ]

              country  population    square
Country Code
RU             Russia       143.5  17125191
BY            Belarus         9.5    207600

In [24]:
## filtering
# retrieve countries with population > 10
#df['population' > 10] #error str and int are not comparable
# solution: use attribute notation (i.e. df.population )
df[df.population > 10]

                 country  population    square
Country Code
KZ            Kazakhstan       17.04   2724902
RU                Russia      143.50  17125191
UA               Ukraine       45.50    603628

In [25]:
# retrieve countries along with their areas that have population greater than 10
# df[condition][[column list]]
df[df.population > 10] [['country', 'square']]

                 country    square
Country Code
KZ            Kazakhstan   2724902
RU                Russia  17125191
UA               Ukraine    603628

In [26]:
## extending the dataframe
# add new column with population density (density = population/ area)
df['density'] = (df.population / df.square) * 1000000
df

                 country  population    square    density
Country Code
KZ            Kazakhstan       17.04   2724902   6.253436
RU                Russia      143.50  17125191   8.379469
BY               Belarus        9.50    207600  45.761079
UA               Ukraine       45.50    603628  75.377550

In [27]:
# delete a column
del df['density']
df

                 country  population    square
Country Code
KZ            Kazakhstan       17.04   2724902
RU                Russia      143.50  17125191
BY               Belarus        9.50    207600
UA               Ukraine       45.50    603628

In [28]:
### writing datafram to a file
df.to_csv('countries.csv')

In [29]:
### reading a csv file
# note: pandas supports many file formats including CSV, XML, HTML, Excel, SQL, JSON
df2 = pd.read_csv('countries.csv')
df2

  Country Code     country  population    square
0           KZ  Kazakhstan       17.04   2724902
1           RU      Russia      143.50  17125191
2           BY     Belarus        9.50    207600
3           UA     Ukraine       45.50    603628

In [30]:
### Grouping
# for testing purposes, we will use sample datasets instead of creating a new one
# sample datasets are included in seaborn library

In [31]:
import seaborn as sns
titanic_df = sns.load_dataset('titanic')

In [52]:
# head() method displays the first 5 rows of a dataframe
titanic_df.head()
# head(n) displays the first n rows of a dataframe
#titanic_df.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
P_ID,,,,,,,,,,,,,,,
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [33]:
# same goes for tail() method but to display the last rows
titanic_df.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [34]:
# shape -- number of observations and number of features
titanic_df.shape # 891 observations(rows) and 15 features (cols)

(891, 15)

In [35]:
# set a name for the index column
titanic_df.index.name='P_ID'
titanic_df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
P_ID,,,,,,,,,,,,,,,
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [36]:
# count survived and not survived persons 
# groupby([features list]) . function()
titanic_df.groupby([ 'survived']).count()

,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
survived,,,,,,,,,,,,,,
0,549,549,424,549,549,549,549,549,549,549,67,549,549,549
1,342,342,290,342,342,342,340,342,342,342,136,340,342,342

In [37]:
# note: count is the same with all cloumns (except for the not complete ones)
# It is preferred to display count once using any of the completed columns, pclass for example
titanic_df.groupby([ 'survived']) ['pclass'].count()

survived
0    549
1    342
Name: pclass, dtype: int64

In [38]:
# count survived and not survived persons grouped by sex
#titanic_df.groupby(['sex', 'survived']) .count()
titanic_df.groupby(['sex', 'survived']) ['pclass'].count()

sex     survived
female  0            81
        1           233
male    0           468
        1           109
Name: pclass, dtype: int64

In [39]:
## pivot table: create a new derived table out of your original one
# count of passengers' ages in each class indexed by sex column
pvt = titanic_df.pivot_table(index=['sex'], columns=['pclass'], values=['age'], aggfunc='count')
pvt

        age
pclass    1   2    3
sex
female   85  74  102
male    101  99  253

In [54]:
## sub-setting a dataframe
# extract class, sex, and age of survived passenfers from the titanic dataframe
titanic_survived = titanic_df[['pclass','sex','age']][titanic_df.survived == 1]
titanic_survived.head()

      pclass     sex   age
P_ID
1          1  female  38.0
2          3  female  26.0
3          1  female  35.0
8          3  female  27.0
9          2  female  14.0

In [56]:
# extract female passengers information who is a woman or child
titanic_df[(titanic_df.who == 'woman') | (titanic_df.who == 'child')].head()
titanic_df[titanic_df['who'].isin(['woman','child'])].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
P_ID,,,,,,,,,,,,,,,
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False

In [4]:
### Iterating over dataframe
# you can iterate using the traditional for loop with the help of iterrows() method which gives you (index, row)
sample_df = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,8]]), columns=['A','B','C'])
for index, row in sample_df.iterrows():
    print(row['A'],row['C'])

1 3
4 6
7 8

In [43]:
### iterating using for may be slow in large datasets
# solution: use apply() method

# loop over the titanic_survived dataframe, create a new feature 'label' and for each 'female' place 'F' and for each 'male' place a 'M' label

# first we will define a labeling function 
def labeling(x):
    if x == 'female':
        return 'F'
    else:
        return 'M'

In [44]:
# then,apply it using apply function
titanic_survived['label'] = titanic_survived['sex'].apply(labeling)
titanic_survived.head()

      pclass     sex   age label
P_ID
1          1  female  38.0     F
2          3  female  26.0     F
3          1  female  35.0     F
8          3  female  27.0     F
9          2  female  14.0     F

In [59]:
## lambda Function:lambda x: function code. for example to increase all items by 1 'lambda x: x + 1'
# very short functions or functions that you do not intend to use multiple times,
# naming the function may not be necessary. 
# The function used above could be written more quickly as a lambda function, or a function without a name.
# 
titanic_survived['lambda_label'] = titanic_survived['sex'].apply(lambda x: 'F' if x == 'female' else 'M')
titanic_survived.head()

      pclass     sex   age lambda_label
P_ID
1          1  female  38.0            F
2          3  female  26.0            F
3          1  female  35.0            F
8          3  female  27.0            F
9          2  female  14.0            F

In [46]:
### map(), filter()

# map()  applies a function to all the items in an input_list
# map(function_to_apply, list_of_inputs)
ser = pd.Series([0,1,2,3])

# increase all elements by 1
#ser2 = ser.map(lambda x: x+1)
ser2 = map(lambda x: x+1, ser)
list(ser2)

[1, 2, 3, 4]

In [47]:
# filter() creates a list of elements for which a function returns true.
lst = [0,1,1,2,3,5,8,13,21,34,55]
result = filter(lambda x: x > 3, lst)
print(list(result))

[5, 8, 13, 21, 34, 55]

In [9]:
### Re-shaping a DataFrame
header = pd.MultiIndex.from_product([['Semester1','Semester2'],['Maths','Science']])
d=([[12,45,67,56],[78,89,45,67],[45,67,89,90],[67,44,56,55]])
 
 
df = pd.DataFrame(d,
                  index=['Alisa','Bobby','Cathrine','Jack'],
                  columns=header)
df

         Semester1         Semester2
             Maths Science     Maths Science
Alisa           12      45        67      56
Bobby           78      89        45      67
Cathrine        45      67        89      90
Jack            67      44        56      55

In [6]:
# stack() -- by default at level 1 of indexing
stacked_df_level1 = df.stack()
stacked_df_level1

                  Semester1  Semester2
Alisa    Maths           12         67
         Science         45         56
Bobby    Maths           78         45
         Science         89         67
Cathrine Maths           45         89
         Science         67         90
Jack     Maths           67         56
         Science         44         55

In [7]:
# stack(level=) -- specify the index level
stacked_df_level0 = df.stack(0)
stacked_df_level0

                    Maths  Science
Alisa    Semester1     12       45
         Semester2     67       56
Bobby    Semester1     78       89
         Semester2     45       67
Cathrine Semester1     45       67
         Semester2     89       90
Jack     Semester1     67       44
         Semester2     56       55

In [8]:
# unstack()
unstacked_df = stacked_df_level0.unstack()
unstacked_df

             Maths             Science
         Semester1 Semester2 Semester1 Semester2
Alisa           12        67        45        56
Bobby           78        45        89        67
Cathrine        45        89        67        90
Jack            67        56        44        55